#include "datageneration.h"

//>>>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// 随机获取1000个数组的长度(长度范围: 2048-5000),并生成高度数据(高度范围: 0.00-5000.00)
// 赋值给每个数组的元素
void generateHeightData(int arrayLenArr[],int arrayCnt,float ** pHeightDataArr)
{
    srand((unsigned)time( NULL ));                  //初始化随机数

    for (int i = 0; i < arrayCnt; ++i)              // 轮询需要生成高度数据的数量
    {
        // 随机生成数组长度
        arrayLenArr[i] = RANDOM_ARR_LENGTH;
        // 开辟数组空间
        pHeightDataArr[i] = (float *) malloc ( sizeof(float) * arrayLenArr[i]);

        if(NULL != pHeightDataArr[i])
        {
            // 随机生成高度数据,高度范围在[0.00-5000.00]之间(单位:um)
            for (int j = 0; j < arrayLenArr[i]; ++j)    // 根据数组的长度给数组元素赋值
            {
                // 随机生成高度数据并存放在目标数组中
                pHeightDataArr[i][j] = RANDOM_HEIGHT_DATA;
            }
        }
        else
        {
            printf("存储随机数时,开辟内存失败");
        }
    }
}

//<<<----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
