#include <stdio.h>
#include <time.h>

#include "datageneration.h"
#include "imagecompression.h"

//>>>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//图像压缩算法
/**
 *  @brief  1.创建1000个float数组，长度从2048到5000随机生成，
 *            数据范围从0.00-5000.00随机生成
 *          2.遍历所有的数组,判断数组长度:
 *            如果长度>=4096,直接压缩;
 *            如果长度<4096,那么需要和其他长度小于<4096的数组压缩到到同一个的byte数组中,
 *            直到byte数组的元素个数>=4096,再压缩
 *
 *            byte数组需要设置表头,表头定义如下:
 *            a.数组中第1个元素：byte数组中压缩的float数组的个数
 *            b.数组中第2,3个byte：第一个数组的长度
 *            c.数组中第4,5个byte：第一个数组的最大值(整型)
 *            d.数组中第6,7个byte：第一个数组的最小值(整型)
 *            e.数组中往后n个byte：float数组每一个数据转化成一个byte
 *            f.如果存多个数据，依次往后按照步骤 b - e方式将数据存放到byte数组中
 *            备注:float数组中每一个小数部分去除,整数部分按照其最大值与最小值的范围
 *                映射到[0 - 255]
 *          3.将byte数组保存为文件,文件名按照压缩的元件名,如Byte只压缩一个数组,则文件名
 *            为"chip001",如果byte数组中压缩了多个数组,则文件名为"chip001_chip002"
 *          4.读取保存的文件,按照压缩的规则把高度从byte解析到float数组中
 *          5.计算压缩前数据与解压后数据的差值,并将每个数组的差值写入文件中,
 *            文件名以元件名加"_diff"组成,如chip001_diff
 *          6.计算压缩与解压的总时间,并在终端上显示
 *
 *  @author  bob
 *  @version 1.00 2017-11-06 bob
 */

//<<<----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

//>>>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//定义全局变量
#define IMAGE_COUNT 1000                                // 图片的数量为1000
#define BLOCK_SIZE  4096                                // 单个区块的大小
#define FILE_DIR "./Data/"

//<<<----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


int main()
{
    //>>>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    //生成数据
    int arrayLenArr[IMAGE_COUNT];                      //数组的长度数组
    float * pHeightDataArr[IMAGE_COUNT];               //存储高度数据数组的头指针

    // 获取指定数量数组长度,并给每个数组的高度数据赋值
    generateHeightData(arrayLenArr,
                       IMAGE_COUNT,
                       pHeightDataArr);

    //>>>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


    for (int i = 0; i < IMAGE_COUNT; ++i)
    {
        free(pHeightDataArr[i]);       //释放存储原始数据数组的空间,并将其指针置为NULL

        pHeightDataArr[i] = NULL;

    }
}
